fdmysterious/docker-cmake-dsc-codewarrior/app/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#define GPIO_PUR_PU_15_MASK 0x8000u /*!<@brief Pull Resistor Enable Bits Mask for item 15. */
#define GPIO_PUR_PU_1_MASK 0x02u    /*!<@brief Pull Resistor Enable Bits Mask for item 1. */
#define GPIO_PUR_PU_4_MASK 0x10u    /*!<@brief Pull Resistor Enable Bits Mask for item 4. */
#define GPIO_PUR_PU_6_MASK 0x40u    /*!<@brief Pull Resistor Enable Bits Mask for item 6. */
#define PUR_PU_15_DISABLED 0x00u    /*!<@brief Pull Resistor Enable Bits: Pull resistor is disabled */
#define PUR_PU_1_DISABLED 0x00u     /*!<@brief Pull Resistor Enable Bits: Pull resistor is disabled */
#define PUR_PU_4_DISABLED 0x00u     /*!<@brief Pull Resistor Enable Bits: Pull resistor is disabled */
#define PUR_PU_6_DISABLED 0x00u     /*!<@brief Pull Resistor Enable Bits: Pull resistor is disabled */

/*! @name GPIOF6 (number 94), SW4
  @{ */
#define BOARD_SW4_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define BOARD_SW4_PIN 6U              /*!<@brief GPIOF pin index: 6 */
#define BOARD_SW4_PIN_MASK kGPIO_Pin6 /*!<@brief PORT pin mask */
                                      /* @} */

/*! @name GPIOF1 (number 77), SW3
  @{ */
#define BOARD_SW3_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define BOARD_SW3_PIN 1U              /*!<@brief GPIOF pin index: 1 */
#define BOARD_SW3_PIN_MASK kGPIO_Pin1 /*!<@brief PORT pin mask */
                                      /* @} */

/*! @name GPIOF15 (number 46), SW2
  @{ */
#define BOARD_SW2_GPIO GPIOF           /*!<@brief GPIO device name: GPIOF */
#define BOARD_SW2_PIN 15U              /*!<@brief GPIOF pin index: 15 */
#define BOARD_SW2_PIN_MASK kGPIO_Pin15 /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name GPIOC4 (number 12), SW5
  @{ */
#define BOARD_SW5_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_SW5_PIN 4U              /*!<@brief GPIOC pin index: 4 */
#define BOARD_SW5_PIN_MASK kGPIO_Pin4 /*!<@brief PORT pin mask */
                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBUTTONsPins(void);

#define GPIO_PUS_PUS_10_MASK 0x0400u /*!<@brief Pull Resistor Type Select Bits Mask for item 10. */
#define GPIO_PUS_PUS_11_MASK 0x0800u /*!<@brief Pull Resistor Type Select Bits Mask for item 11. */
#define GPIO_PUS_PUS_8_MASK 0x0100u  /*!<@brief Pull Resistor Type Select Bits Mask for item 8. */
#define GPIO_PUS_PUS_9_MASK 0x0200u  /*!<@brief Pull Resistor Type Select Bits Mask for item 9. */
#define PUS_PUS_10_PULLDOWN 0x00u    /*!<@brief Pull Resistor Type Select Bits: Pulldown resistor */
#define PUS_PUS_11_PULLDOWN 0x00u    /*!<@brief Pull Resistor Type Select Bits: Pulldown resistor */
#define PUS_PUS_8_PULLDOWN 0x00u     /*!<@brief Pull Resistor Type Select Bits: Pulldown resistor */
#define PUS_PUS_9_PULLDOWN 0x00u     /*!<@brief Pull Resistor Type Select Bits: Pulldown resistor */

/*! @name GPIOF8 (number 6), USER_LED1
  @{ */
#define BOARD_LED_RED_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define BOARD_LED_RED_PIN 8U              /*!<@brief GPIOF pin index: 8 */
#define BOARD_LED_RED_PIN_MASK kGPIO_Pin8 /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name GPIOF11 (number 45), USER_LED4
  @{ */
#define BOARD_LED_YELLOW_GPIO GPIOF           /*!<@brief GPIO device name: GPIOF */
#define BOARD_LED_YELLOW_PIN 11U              /*!<@brief GPIOF pin index: 11 */
#define BOARD_LED_YELLOW_PIN_MASK kGPIO_Pin11 /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name GPIOF10 (number 56), USER_LED3
  @{ */
#define BOARD_LED_BLUE_GPIO GPIOF           /*!<@brief GPIO device name: GPIOF */
#define BOARD_LED_BLUE_PIN 10U              /*!<@brief GPIOF pin index: 10 */
#define BOARD_LED_BLUE_PIN_MASK kGPIO_Pin10 /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name GPIOF9 (number 57), USER_LED2
  @{ */
#define BOARD_LED_GREEN_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define BOARD_LED_GREEN_PIN 9U              /*!<@brief GPIOF pin index: 9 */
#define BOARD_LED_GREEN_PIN_MASK kGPIO_Pin9 /*!<@brief PORT pin mask */
                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDsPins(void);

/*! @name GPIOC0 (number 3), Y1[1]/EXTAL
  @{ */
#define BOARD_EXTAL_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_EXTAL_PIN 0U              /*!<@brief GPIOC pin index: 0 */
#define BOARD_EXTAL_PIN_MASK kGPIO_Pin0 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOC1 (number 4), Y1[3]/XTAL
  @{ */
#define BOARD_XTAL_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_XTAL_PIN 1U              /*!<@brief GPIOC pin index: 1 */
#define BOARD_XTAL_PIN_MASK kGPIO_Pin1 /*!<@brief PORT pin mask */
                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitOSCsPins(void);

/*! @name GPIOA7 (number 17), THER_B
  @{ */
#define BOARD_THER_B_GPIO GPIOA          /*!<@brief GPIO device name: GPIOA */
#define BOARD_THER_B_PIN 7U              /*!<@brief GPIOA pin index: 7 */
#define BOARD_THER_B_PIN_MASK kGPIO_Pin7 /*!<@brief PORT pin mask */
                                         /* @} */

/*! @name GPIOA6 (number 19), THER_A
  @{ */
#define BOARD_THER_A_GPIO GPIOA          /*!<@brief GPIO device name: GPIOA */
#define BOARD_THER_A_PIN 6U              /*!<@brief GPIOA pin index: 6 */
#define BOARD_THER_A_PIN_MASK kGPIO_Pin6 /*!<@brief PORT pin mask */
                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitTHERMISTORPins(void);

