fdmysterious/docker-cmake-dsc-codewarrior/app/board/pin_mux.h
#define GPIO_PUS_PUS_13_MASK 0x2000u /*!<@brief Pull Resistor Type Select Bits Mask for item 13. */
#define PUS_PUS_13_PULLUP 0x2000u    /*!<@brief Pull Resistor Type Select Bits: Pullup resistor */

/*! @name GPIOF13 (number 90), U7[A1]/USB_PWR
  @{ */
#define BOARD_USB_PWR_GPIO GPIOF           /*!<@brief GPIO device name: GPIOF */
#define BOARD_USB_PWR_PIN 13U              /*!<@brief GPIOF pin index: 13 */
#define BOARD_USB_PWR_PIN_MASK kGPIO_Pin13 /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name GPIOF14 (number 91), U7[A2]/USB_OC
  @{ */
#define BOARD_USB_OC_GPIO GPIOF           /*!<@brief GPIO device name: GPIOF */
#define BOARD_USB_OC_PIN 14U              /*!<@brief GPIOF pin index: 14 */
#define BOARD_USB_OC_PIN_MASK kGPIO_Pin14 /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name USB_DP (number 39), USB_DP
  @{ */
/* @} */

/*! @name USB_DM (number 40), USB_DM
  @{ */
/* @} */

/*! @name GPIOF12 (number 89), J16[2]/Q2[2]/USB_OTG_ID
  @{ */
#define BOARD_USB_OTG_ID_GPIO GPIOF           /*!<@brief GPIO device name: GPIOF */
#define BOARD_USB_OTG_ID_PIN 12U              /*!<@brief GPIOF pin index: 12 */
#define BOARD_USB_OTG_ID_PIN_MASK kGPIO_Pin12 /*!<@brief PORT pin mask */
                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUSBOTGPins(void);

/*! @name GPIOG11 (number 48), U8[5]/MOSI1
  @{ */
#define BOARD_SPI_FLASH_MOSI_GPIO GPIOG           /*!<@brief GPIO device name: GPIOG */
#define BOARD_SPI_FLASH_MOSI_PIN 11U              /*!<@brief GPIOG pin index: 11 */
#define BOARD_SPI_FLASH_MOSI_PIN_MASK kGPIO_Pin11 /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name GPIOD7 (number 47), U8[2]/MISO1
  @{ */
#define BOARD_SPI_FLASH_MISO_GPIO GPIOD          /*!<@brief GPIO device name: GPIOD */
#define BOARD_SPI_FLASH_MISO_PIN 7U              /*!<@brief GPIOD pin index: 7 */
#define BOARD_SPI_FLASH_MISO_PIN_MASK kGPIO_Pin7 /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name GPIOF0 (number 55), U8[6]/SCLK1
  @{ */
#define BOARD_SPI_FLASH_SCLK_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define BOARD_SPI_FLASH_SCLK_PIN 0U              /*!<@brief GPIOF pin index: 0 */
#define BOARD_SPI_FLASH_SCLK_PIN_MASK kGPIO_Pin0 /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name GPIOF7 (number 95), U8[1]/SS1
  @{ */
#define BOARD_SPI_FLASH_SS_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define BOARD_SPI_FLASH_SS_PIN 7U              /*!<@brief GPIOF pin index: 7 */
#define BOARD_SPI_FLASH_SS_PIN_MASK kGPIO_Pin7 /*!<@brief PORT pin mask */
                                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSPI_FLASHPins(void);

/*! @name GPIOE0 (number 68), J3[13]/U3A[1]/GE0/PWMA_0B/LED0
  @{ */
#define BOARD_PWM_LED0_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define BOARD_PWM_LED0_PIN 0U              /*!<@brief GPIOE pin index: 0 */
#define BOARD_PWM_LED0_PIN_MASK kGPIO_Pin0 /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name GPIOE1 (number 69), J3[15]/U3B[3]/GE1/PWMA_0A/LED1
  @{ */
#define BOARD_PWM_LED1_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define BOARD_PWM_LED1_PIN 1U              /*!<@brief GPIOE pin index: 1 */
#define BOARD_PWM_LED1_PIN_MASK kGPIO_Pin1 /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name GPIOE2 (number 74), J3[9]/GE2/PWMA_1B
  @{ */
#define BOARD_PWM_LED2_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define BOARD_PWM_LED2_PIN 2U              /*!<@brief GPIOE pin index: 2 */
#define BOARD_PWM_LED2_PIN_MASK kGPIO_Pin2 /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name GPIOE3 (number 75), J3[11]/GE3/PWMA_1A
  @{ */
#define BOARD_PWM_LED3_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define BOARD_PWM_LED3_PIN 3U              /*!<@brief GPIOE pin index: 3 */
#define BOARD_PWM_LED3_PIN_MASK kGPIO_Pin3 /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name GPIOE4 (number 82), J3[5]/GE4/PWMA_2B
  @{ */
#define BOARD_PWM_LED4_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define BOARD_PWM_LED4_PIN 4U              /*!<@brief GPIOE pin index: 4 */
#define BOARD_PWM_LED4_PIN_MASK kGPIO_Pin4 /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name GPIOE5 (number 83), J3[7]/GE5/PWMA_2A
  @{ */
#define BOARD_PWM_LED5_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define BOARD_PWM_LED5_PIN 5U              /*!<@brief GPIOE pin index: 5 */
#define BOARD_PWM_LED5_PIN_MASK kGPIO_Pin5 /*!<@brief PORT pin mask */
                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPWM_LEDsPins(void);

#define GPIO_PUR_PU_8_MASK 0x0100u /*!<@brief Pull Resistor Enable Bits Mask for item 8. */
#define GPIO_PUR_PU_9_MASK 0x0200u /*!<@brief Pull Resistor Enable Bits Mask for item 9. */
#define PUR_PU_8_DISABLED 0x00u    /*!<@brief Pull Resistor Enable Bits: Pull resistor is disabled */
#define PUR_PU_9_DISABLED 0x00u    /*!<@brief Pull Resistor Enable Bits: Pull resistor is disabled */

/*! @name GPIOF2 (number 60), U11[4]/I2C_SCL1
  @{ */
#define BOARD_ACCEL_MAGNET_SCL_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define BOARD_ACCEL_MAGNET_SCL_PIN 2U              /*!<@brief GPIOF pin index: 2 */
#define BOARD_ACCEL_MAGNET_SCL_PIN_MASK kGPIO_Pin2 /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name GPIOF3 (number 61), U11[6]/I2C_SDA1
  @{ */
#define BOARD_ACCEL_MAGNET_SDA_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define BOARD_ACCEL_MAGNET_SDA_PIN 3U              /*!<@brief GPIOF pin index: 3 */
#define BOARD_ACCEL_MAGNET_SDA_PIN_MASK kGPIO_Pin3 /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name GPIOA8 (number 18), U11[11]/INT1_COMBO
  @{ */
#define BOARD_ACCEL_MAGNET_INT1_GPIO GPIOA          /*!<@brief GPIO device name: GPIOA */
#define BOARD_ACCEL_MAGNET_INT1_PIN 8U              /*!<@brief GPIOA pin index: 8 */
#define BOARD_ACCEL_MAGNET_INT1_PIN_MASK kGPIO_Pin8 /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name GPIOA9 (number 14), U11[9]/INT2_COMBO
  @{ */
#define BOARD_ACCEL_MAGNET_INT2_GPIO GPIOA          /*!<@brief GPIO device name: GPIOA */
#define BOARD_ACCEL_MAGNET_INT2_PIN 9U              /*!<@brief GPIOA pin index: 9 */
#define BOARD_ACCEL_MAGNET_INT2_PIN_MASK kGPIO_Pin9 /*!<@brief PORT pin mask */
                                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitACCEL_MAGNET_I2CPins(void);

