fdmysterious/docker-cmake-dsc-codewarrior/app/board/pin_mux.h
/*! @name GPIOC2 (number 5), U15[25]/Boot_TXD0
  @{ */
#define BOARD_Boot_TXD0_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_Boot_TXD0_PIN 2U              /*!<@brief GPIOC pin index: 2 */
#define BOARD_Boot_TXD0_PIN_MASK kGPIO_Pin2 /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name GPIOC3 (number 11), U15[26]/Boot_RXD0
  @{ */
#define BOARD_Boot_RXD0_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_Boot_RXD0_PIN 3U              /*!<@brief GPIOC pin index: 3 */
#define BOARD_Boot_RXD0_PIN_MASK kGPIO_Pin3 /*!<@brief PORT pin mask */
                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUSBtoSCIPins(void);

#define GPIO_PUR_PU_10_MASK 0x0400u /*!<@brief Pull Resistor Enable Bits Mask for item 10. */
#define GPIO_PUR_PU_11_MASK 0x0800u /*!<@brief Pull Resistor Enable Bits Mask for item 11. */
#define PUR_PU_10_DISABLED 0x00u    /*!<@brief Pull Resistor Enable Bits: Pull resistor is disabled */
#define PUR_PU_11_DISABLED 0x00u    /*!<@brief Pull Resistor Enable Bits: Pull resistor is disabled */

/*! @name GPIOC11 (number 58), J18[1]/CANTX
  @{ */
#define BOARD_CAN_TX_GPIO GPIOC           /*!<@brief GPIO device name: GPIOC */
#define BOARD_CAN_TX_PIN 11U              /*!<@brief GPIOC pin index: 11 */
#define BOARD_CAN_TX_PIN_MASK kGPIO_Pin11 /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name GPIOC12 (number 59), J18[3]/CANRX
  @{ */
#define BOARD_CAN_RX_GPIO GPIOC           /*!<@brief GPIO device name: GPIOC */
#define BOARD_CAN_RX_PIN 12U              /*!<@brief GPIOC pin index: 12 */
#define BOARD_CAN_RX_PIN_MASK kGPIO_Pin12 /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name GPIOA10 (number 13), J22[2]/U10[8]/CAN_S
  @{ */
#define BOARD_CAN_S_GPIO GPIOA           /*!<@brief GPIO device name: GPIOA */
#define BOARD_CAN_S_PIN 10U              /*!<@brief GPIOA pin index: 10 */
#define BOARD_CAN_S_PIN_MASK kGPIO_Pin10 /*!<@brief PORT pin mask */
                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCANPins(void);

/*! @name GPIOA0 (number 22), J2[1]/CUR_A
  @{ */
#define BOARD_CUR_A_GPIO GPIOA          /*!<@brief GPIO device name: GPIOA */
#define BOARD_CUR_A_PIN 0U              /*!<@brief GPIOA pin index: 0 */
#define BOARD_CUR_A_PIN_MASK kGPIO_Pin0 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOA1 (number 23), J2[5]/CUR_C/GA1
  @{ */
#define BOARD_CUR_CA_GPIO GPIOA          /*!<@brief GPIO device name: GPIOA */
#define BOARD_CUR_CA_PIN 1U              /*!<@brief GPIOA pin index: 1 */
#define BOARD_CUR_CA_PIN_MASK kGPIO_Pin1 /*!<@brief PORT pin mask */
                                         /* @} */

/*! @name GPIOB0 (number 33), J2[3]/CUR_B
  @{ */
#define BOARD_CUR_B_GPIO GPIOB          /*!<@brief GPIO device name: GPIOB */
#define BOARD_CUR_B_PIN 0U              /*!<@brief GPIOB pin index: 0 */
#define BOARD_CUR_B_PIN_MASK kGPIO_Pin0 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOB3 (number 42), J2[5]/CUR_C/GB3
  @{ */
#define BOARD_CUR_CB_GPIO GPIOB          /*!<@brief GPIO device name: GPIOB */
#define BOARD_CUR_CB_PIN 3U              /*!<@brief GPIOB pin index: 3 */
#define BOARD_CUR_CB_PIN_MASK kGPIO_Pin3 /*!<@brief PORT pin mask */
                                         /* @} */

/*! @name GPIOB2 (number 36), J2[9]/CUR_DCB
  @{ */
#define BOARD_CUR_DCB_GPIO GPIOB          /*!<@brief GPIO device name: GPIOB */
#define BOARD_CUR_DCB_PIN 2U              /*!<@brief GPIOB pin index: 2 */
#define BOARD_CUR_DCB_PIN_MASK kGPIO_Pin2 /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name GPIOA2 (number 24), J2[7]/VOLT_DCB
  @{ */
#define BOARD_VOLT_DCB_GPIO GPIOA          /*!<@brief GPIO device name: GPIOA */
#define BOARD_VOLT_DCB_PIN 2U              /*!<@brief GPIOA pin index: 2 */
#define BOARD_VOLT_DCB_PIN_MASK kGPIO_Pin2 /*!<@brief PORT pin mask */
                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitANA_SENSEPins(void);

/*! @name GPIOB7 (number 26), J9[1]/ANVP
  @{ */
#define BOARD_ANVP_GPIO GPIOB          /*!<@brief GPIO device name: GPIOB */
#define BOARD_ANVP_PIN 7U              /*!<@brief GPIOB pin index: 7 */
#define BOARD_ANVP_PIN_MASK kGPIO_Pin7 /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name GPIOB6 (number 28), J9[1]/CMPB_IN1
  @{ */
#define BOARD_CMPB_IN1_GPIO GPIOB          /*!<@brief GPIO device name: GPIOB */
#define BOARD_CMPB_IN1_PIN 6U              /*!<@brief GPIOB pin index: 6 */
#define BOARD_CMPB_IN1_PIN_MASK kGPIO_Pin6 /*!<@brief PORT pin mask */
                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitADC_CMPPins(void);

/*! @name GPIOD6 (number 9), U14C[9]/TXD_BDM
  @{ */
#define BOARD_TXD_BDM_GPIO GPIOD          /*!<@brief GPIO device name: GPIOD */
#define BOARD_TXD_BDM_PIN 6U              /*!<@brief GPIOD pin index: 6 */
#define BOARD_TXD_BDM_PIN_MASK kGPIO_Pin6 /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name GPIOD5 (number 10), U13[3]/RXD_BDM
  @{ */
#define BOARD_RXD_BDM_GPIO GPIOD          /*!<@brief GPIO device name: GPIOD */
#define BOARD_RXD_BDM_PIN 5U              /*!<@brief GPIOD pin index: 5 */
#define BOARD_RXD_BDM_PIN_MASK kGPIO_Pin5 /*!<@brief PORT pin mask */
                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
